lvx/base/DataProcessors/бит_ОтражениеДДСВФактеБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ОтражениеДДСВФактеБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПроверкиАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверяемыеАналитики</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПервичныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяТрансляция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнениеАналитик</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБюджет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_ОтражениеДДСВФактеБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаписьИзменений

Функция ЗаписатьИзмененияОбъектов(ОбъектыДляЗаписи, ПараметрыЗаписи) Экспорт
		
	ЗакрытыеДляРедактирования = ОбъектыЗакрытыеДляРедактирования(ОбъектыДляЗаписи);
	ПропущенныеОбъекты		  = Новый Массив;	
	
	Для каждого ОбъектСсылка Из ОбъектыДляЗаписи Цикл
		Если ЗакрытыеДляРедактирования.Найти(ОбъектСсылка) <> Неопределено Тогда
			ПропущенныеОбъекты.Добавить(ОбъектСсылка);
			ТекстСообщения = НСтр("ru = 'Документ %1 находится закрытом периоде. Редактирование запрещено.'; 
								|en = 'Document %1 is in a closed period. Editing is prohibited.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектСсылка);
			Продолжить;
		КонецЕсли;
		
		Если ОбъектСсылка.ПометкаУдаления Тогда 
			ТекстСообщения = НСтр("ru = 'Документ %1 пропущен: пометка на удаление.'; 
				|en = 'Document %1 is marked for deletion.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
			ПропущенныеОбъекты.Добавить(ОбъектСсылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектСсылка);
			Продолжить;
		КонецЕсли;	
		
		НачатьТранзакцию();
		Попытка		
			Если ПараметрыЗаписи.ВыполнитьПроведение Тогда 
				УдалосьПровести = УдалосьПровестиДокумент(ОбъектСсылка);
				Если НЕ УдалосьПровести Тогда
					ПропущенныеОбъекты.Добавить(ОбъектСсылка);				
				КонецЕсли;
			ИначеЕсли ПараметрыЗаписи.ВыполнитьПроведениеБит Тогда 
				УдалосьПровести = УдалосьВыполнитьПроведениеБитСервер(ОбъектСсылка);
				Если НЕ УдалосьПровести Тогда
					ПропущенныеОбъекты.Добавить(ОбъектСсылка);
				КонецЕсли;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Ошибка обработки документа %1. По причине: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектСсылка);
		КонецПопытки;
	КонецЦикла;
		
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Сообщения",		   Новый Массив);
	// Не вполне понятно как работают сообщения. Возможно в пред. сборке они работали не штатно,
	// поэтому приходилось получать: ПолучитьСообщенияПользователю(Истина));
	// Теперь для совместимости использую массив.
	РезультатВыполнения.Вставить("ПропущенныеОбъекты", ПропущенныеОбъекты);
	
	Возврат РезультатВыполнения;

КонецФункции
	
#КонецОбласти // ЗаписьИзменений

Функция ИнициализироватьКомпоновщик(Компоновщик, НастройкиКомпоновкиДанных) Экспорт

	СхемаКомпоновкиДанных = Обработки.бит_ОтражениеДДСВФактеБюджета.ПолучитьМакет("ДокументыДвижений");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек		   = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Попытка
		Компоновщик.Инициализировать(ИсточникНастроек);	
	Исключение 
		ТекстСообщения = НСтр("ru='Невозможно применить настройки. По причине: %1';
							  |en='It is impossible to apply the settings. Due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	КонецПопытки;
		
	Если НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	

		НастройкиКомпоновкиДанных.Выбор.Элементы.Очистить();
		ОсновнойВариант = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		Для каждого Элемент Из ОсновнойВариант.Выбор.Элементы Цикл
			бит_ОтчетыБФКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновкиДанных, Элемент.Поле);	
		КонецЦикла;
		Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	Возврат АдресСхемыКомпоновкиДанных;

КонецФункции

Функция НовыеСохраняемыеНастройки() Экспорт 
	
	СохраняемыеНастройки = Новый Структура;
	СохраняемыеНастройки.Вставить("Период", 			       Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц));
	СохраняемыеНастройки.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных);
	СохраняемыеНастройки.Вставить("РежимКонтроля",             0);
	СохраняемыеНастройки.Вставить("РежимПроверкиАналитик",     0);
	
	ПроверяемыеАналитики = Новый СписокЗначений;
	ПроверяемыеАналитики.Добавить(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов);
	ПроверяемыеАналитики.Добавить(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО);
	
	СохраняемыеНастройки.Вставить("ПроверяемыеАналитики", ПроверяемыеАналитики);

	Возврат СохраняемыеНастройки;
	
КонецФункции

Функция ПрименитьНастройки(НастройкаПодбораДокументов, Обработка) Экспорт

	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(НастройкаПодбораДокументов) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодбораДокументов, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
	
	АдресСКД = ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек, 
						ШаблонНастроек.НастройкиКомпоновкиДанных);
						
	ЗаполнитьЗначенияСвойств(Обработка, ШаблонНастроек);
	
	Если ШаблонНастроек.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		Обработка.Период = Новый СтандартныйПериод(ШаблонНастроек.Период.ДатаНачала, 
									ШаблонНастроек.Период.ДатаОкончания);
	Иначе	
		Обработка.Период = Новый СтандартныйПериод(ШаблонНастроек.Период.Вариант);
	КонецЕсли;

	Возврат АдресСКД;	

КонецФункции

Функция ЗаполнитьПереченьДокументов(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, Настройки) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПереченьПолный = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПереченьПолный);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТаблицаПереченьПолный.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка", ,
															 Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ПроверитьОтклонениеСуммыОтражения(ТаблицаПереченьПолный, Настройки);
	ПроверитьЗаполнениеАналитик(ТаблицаПереченьПолный, Настройки);
	ПроверитьСоответствиеСтатейОборотов(ТаблицаПереченьПолный, Настройки);
	УдалитьСтрокиБезОшибок(ТаблицаПереченьПолный, Настройки);
	
	Возврат ТаблицаПереченьПолный;
	
КонецФункции

Функция НовыеНастройкиПроверкиЗаполнения() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("РежимКонтроля",         0);
	Настройки.Вставить("ПроверяемыеАналитики",  Неопределено);
	Настройки.Вставить("РежимПроверкиАналитик", 0);
	
	Возврат Настройки;
	
КонецФункции

Функция ВедетсяСоответствиеСтатейОборотов() Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеСтатей.СтатьяРегл КАК СтатьяРегл
	|ИЗ
	|	РегистрСведений.бит_СтатьиОборотов_СтатьиРегл КАК СоответствиеСтатей";
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаписьИзменений

Функция ОбъектыЗакрытыеДляРедактирования(ОбъектыДляОбработки)
	
	ЗакрытыеДляРедактирования = Новый Массив;
    
    Для каждого ОбъектСсылка Из ОбъектыДляОбработки Цикл
		МетаОбъект			 = ОбъектСсылка.Метаданные();
        ЗапретРедактирования = бит_ДатыЗапретаРедактирования.ВыполнитьПроверкуДатыЗапретаРедактирования(
									МетаОбъект, ОбъектСсылка);
        Если ЗапретРедактирования Тогда
            ЗакрытыеДляРедактирования.Добавить(ОбъектСсылка);
        КонецЕсли;
    КонецЦикла;

    Возврат ЗакрытыеДляРедактирования;
	
КонецФункции

Функция УдалосьВыполнитьПроведениеБитСервер(ОбъектСсылка)
	
	Отказ 		    = Ложь;
	РежимПроведения = РежимЗаписиДокумента.Запись;
	ДокументОбъект  = ОбъектСсылка.ПолучитьОбъект();
	
	бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(ДокументОбъект, Отказ, РежимПроведения, Истина);
	
	Если НЕ Отказ Тогда
		ТрансляцияВыполнена = УдалосьВыполнитьТрансляциюПроводок(ДокументОбъект);
		Если НЕ ТрансляцияВыполнена Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция УдалосьВыполнитьТрансляциюПроводок(ДокументОбъект)
	
	Отказ = Ложь;
	ИспользуетсяМеханизмКонтроляЗакрытогоПериода = бит_ОбщегоНазначения.ЕстьМеханизмКонтроляЗакрытогоПериода();
	Если ИспользуетсяМеханизмКонтроляЗакрытогоПериода Тогда			
		// При наличии механизма контроля закрытого периода сохраним движения для последующего анализа.
		бит_КонтрольЗакрытогоПериода.КонсервироватьДвижения(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	КонецЕсли;
	
	// МХО.
	бит_МеханизмХозяйственныхОперацийСервер.бит_мхо_НастраиваемыеДвиженияДокументовОбработкаПроведения(
		ДокументОбъект, Отказ, РежимПроведенияДокумента.Неоперативный);
	Для каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		Если НаборЗаписей.Записывать Тогда
			ДокументОбъект.Движения.Записать();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	// Трансляция.
	бит_МеханизмТрансляции.ВыполнитьТрансляцию(ДокументОбъект,,, Истина, Перечисления.бит_РежимыТрансляции.Ручной);
	Если ИспользуетсяМеханизмКонтроляЗакрытогоПериода Тогда			
		// При наличии механизма контроля закрытого периода сформируем корректирующие проводки.
		бит_КонтрольЗакрытогоПериода.КонтрольПриОбработкеПроведения(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, Истина);	
	КонецЕсли;	
	
	Если ДокументОбъект.Заблокирован() Тогда	
		ДокументОбъект.Разблокировать(); 	
	КонецЕсли;
	
	Возврат НЕ Отказ;
		
КонецФункции

Функция УдалосьПровестиДокумент(ОбъектСсылка)

	УдалосьПровести = Истина;
	ДокументОбъект	= ОбъектСсылка.ПолучитьОбъект();	
	
	Попытка
		ДокументОбъект.Заблокировать();
		МожноЗаписатьДокумент = Истина;
	Исключение
		ТекстСообщения = НСтр("ru='Документ %1 заблокирован. Проведение невозможно.';
							  |en='Document %1 blocked. Carrying impossible.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		МожноЗаписатьДокумент = Ложь;
		УдалосьПровести 	  = Ложь;
	КонецПопытки;                 
	
	Если МожноЗаписатьДокумент Тогда
		Успех = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект, 
					РежимЗаписиДокумента.Проведение);
		ДокументОбъект.Разблокировать();
		Если НЕ Успех Тогда
			УдалосьПровести = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УдалосьПровести;
	
КонецФункции

#КонецОбласти // ЗаписьИзменений

Функция ПроверятьСуммыОтражения(РежимКонтроля)
	
	Возврат (РежимКонтроля = 0) ИЛИ (РежимКонтроля = 1) ИЛИ (РежимКонтроля = 4);
	
КонецФункции

Функция ПроверятьЗаполнениеАналитик(РежимКонтроля)
	
	Возврат (РежимКонтроля = 0) ИЛИ (РежимКонтроля = 2) ИЛИ (РежимКонтроля = 4);
	
КонецФункции

Функция ПроверятьСоответствиеСтатейОборотов(РежимКонтроля)
	
	Возврат ((РежимКонтроля = 0) ИЛИ (РежимКонтроля = 3) ИЛИ (РежимКонтроля = 4))
				И ВедетсяСоответствиеСтатейОборотов();
	
КонецФункции

Функция ПоказыватьВсеДокументы(РежимКонтроля)
	
	Возврат (РежимКонтроля = 4);
	
КонецФункции

Процедура ДобавитьОписаниеОшибки(СтрокаДокумента, ТекстОшибки)
	
	ОписаниеОшибки = СтрокаДокумента.ОписаниеОшибки;
	Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;
	КонецЕсли;
	ОписаниеОшибки = ОписаниеОшибки + ТекстОшибки;
	СтрокаДокумента.ОписаниеОшибки = ОписаниеОшибки;
	
КонецПроцедуры

Процедура ПроверитьОтклонениеСуммыОтражения(ТаблицаПереченьПолный, Настройки)
	
	Если НЕ ПроверятьСуммыОтражения(Настройки.РежимКонтроля) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки =
		НСтр("ru='Сумма документа не соответствует сумме отражения в бюджете. Сумма документа: %1, сумма бюджета: %2.'");
	Для каждого СтрокаДокумента Из ТаблицаПереченьПолный Цикл
		СуммаДокумента = СтрокаДокумента.СуммаДокумента;
		СуммаОтражения = СтрокаДокумента.СуммаБюджет;
		Если СуммаДокумента <> СуммаОтражения Тогда
			ТекстОшибки = СтрШаблон(ШаблонОшибки, СуммаДокумента, СуммаОтражения);
			ДобавитьОписаниеОшибки(СтрокаДокумента, ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеАналитик(ПервичныеДокументы, Настройки)
	
	Если НЕ ПроверятьЗаполнениеАналитик(Настройки.РежимКонтроля) ИЛИ НЕ ЗначениеЗаполнено(ПервичныеДокументы) Тогда
		Возврат;
	КонецЕсли;
		
	Если Настройки.РежимПроверкиАналитик = 0 Тогда
		ПроверитьЗаполнениеАналитикИзЗаданногоСписка(ПервичныеДокументы, Настройки);
	Иначе
		ПроверитьЗаполнениеАналитикИзНастройкиСтатьиОборотов(ПервичныеДокументы, Настройки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеАналитикИзЗаданногоСписка(ПервичныеДокументы, Настройки)
	
	ПроверяемыеАналитики = Настройки.ПроверяемыеАналитики;
	Если НЕ ЗначениеЗаполнено(ПроверяемыеАналитики) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСПустойАналитикой = ОбъектыСПустойАналитикойИзЗаданногоСписка(ПервичныеДокументы, Настройки);
	Если ОбъектыСПустойАналитикой.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если ПроверяемыеАналитики.Количество() = 1 Тогда
		ШаблонОшибки = НСтр("ru='Не заполнена аналитика ""%1"".'");
		ТекстОшибки  = СтрШаблон(ШаблонОшибки, ПроверяемыеАналитики[0].Значение);
	Иначе
		ШаблонОшибки = НСтр("ru='Не заполнены одна или несколько аналитик из перечня: %1.'");
		ТекстОшибки  = СтрШаблон(ШаблонОшибки, СтрСоединить(ПроверяемыеАналитики.ВыгрузитьЗначения(), ", "));
	КонецЕсли;
				
	Для каждого СтрокаДокумента Из ПервичныеДокументы Цикл
		Если ОбъектыСПустойАналитикой.НайтиПоЗначению(СтрокаДокумента.Документ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДокумента.ЗаполнениеАналитик = 6;
		ДобавитьОписаниеОшибки(СтрокаДокумента, ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектыСПустойАналитикойИзЗаданногоСписка(ПервичныеДокументы, Настройки)
	
	ОбъектыСПустойАналитикой  = Новый СписокЗначений;
	ПараметрыПроверкиАналитик = ПараметрыПроверкиАналитик(Настройки.ПроверяемыеАналитики);
	ТекстЗапроса              = ТекстЗапросаПроверкиАналитикИзЗаданногоСписка(ПараметрыПроверкиАналитик);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОбъектыПроверки",        ПервичныеДокументы.ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("ПустыеЗначенияАналитик", ПараметрыПроверкиАналитик.ПустыеЗначенияАналитик);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОбъектыСПустойАналитикой;
	КонецЕсли;
	
	ОбъектыСПустойАналитикой.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Объект"));
	Возврат ОбъектыСПустойАналитикой;
	
КонецФункции

Функция ПараметрыПроверкиАналитик(ПроверяемыеАналитики)
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИменаИзмерений",         Новый Массив);
	ПараметрыПроверки.Вставить("ПустыеЗначенияАналитик", Новый Массив);
	
	НастройкиИзмерений       = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений("Аналитика");
	
	ПараметрыПроверки.ПустыеЗначенияАналитик.Добавить(Неопределено);
	Для каждого ЭлементСписка Из ПроверяемыеАналитики Цикл
		Аналитика     = ЭлементСписка.Значение;
		ТипыАналитики = Аналитика.ТипЗначения.Типы();
		Для каждого Тип Из ТипыАналитики Цикл
			ПараметрыПроверки.ПустыеЗначенияАналитик.Добавить(бит_ОбщегоНазначения.ПустоеЗначениеТипа(Тип));
		КонецЦикла;
		
		Если Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО Тогда
			ПараметрыПроверки.ИменаИзмерений.Добавить("ЦФО");
		ИначеЕсли Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов Тогда
			ПараметрыПроверки.ИменаИзмерений.Добавить("СтатьяОборотов");
		Иначе
			НастройкаИзмерения = НастройкиИзмерений.Получить(Аналитика);
			Если НастройкаИзмерения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПараметрыПроверки.ИменаИзмерений.Добавить(НастройкаИзмерения.ИмяИзмерения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыПроверки;
	
КонецФункции

Функция ТекстЗапросаПроверкиАналитикИзЗаданногоСписка(ПараметрыПроверки)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОборотыПоБюджетам.Регистратор КАК Объект
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|ГДЕ
	|	ОборотыПоБюджетам.Регистратор В(&ОбъектыПроверки)
	|	И &УсловиеПустыхАналитик";
	
	ШаблонПоля   = "ОборотыПоБюджетам.%1 В(&ПустыеЗначенияАналитик)";
	УсловияПолей = Новый Массив;
	Для каждого ИмяПоля Из ПараметрыПроверки.ИменаИзмерений Цикл
		УсловияПолей.Добавить(СтрШаблон(ШаблонПоля, ИмяПоля));
	КонецЦикла;
	ТекстУсловияПустыхАналитик = СтрСоединить(УсловияПолей, Символы.ПС + Символы.Таб + "ИЛИ ");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПустыхАналитик", "(" + ТекстУсловияПустыхАналитик + ")");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПроверитьЗаполнениеАналитикИзНастройкиСтатьиОборотов(ПервичныеДокументы, Настройки)
	
	ОбъектыСПустойАналитикой = ОбъектыСПустойАналитикойИзНастройкиСтатьиОборотов(ПервичныеДокументы);
	Если ОбъектыСПустойАналитикой.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеИзмерений = ПредставлениеИзмеренийОборотовПоБюджетам();
	
	ШаблонОшибки = НСтр("ru='Не заполнена аналитика ""%1"".'");
	
	Для каждого СтрокаДокумента Из ПервичныеДокументы Цикл
		ПустыеПоляАналитик = ОбъектыСПустойАналитикой.Получить(СтрокаДокумента.Документ);
		Если ПустыеПоляАналитик = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокумента.ЗаполнениеАналитик = 6;
		
		Для каждого ПолеАналитики Из ПустыеПоляАналитик Цикл
			ТекстОшибки = СтрШаблон(ШаблонОшибки, ПредставлениеИзмерений.Получить(ПолеАналитики));
			ДобавитьОписаниеОшибки(СтрокаДокумента, ТекстОшибки);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектыСПустойАналитикойИзНастройкиСтатьиОборотов(ПервичныеДокументы)
	
	ОбъектыСПустойАналитикой = Новый Соответствие;
	ПоляАналитик             = ИменаПолейАналитикОборотыПоБюджетам();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыПроверки", ПервичныеДокументы.ВыгрузитьКолонку("Документ"));
	Запрос.Текст = ТекстЗапросаПроверкиАналитикИзНастройкиСтатьиОборотов(ПоляАналитик);
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		ОбъектПроверки     = ВыборкаОбъектов.Объект;
		ПустыеПоляАналитик = Новый Массив;
		Выборка            = ВыборкаОбъектов.Выбрать();
		Пока Выборка.Следующий() Цикл
			Для каждого ПолеАналитики Из ПоляАналитик Цикл
				Если Выборка["Обязательный_" + ПолеАналитики]
					И НЕ ЗначениеЗаполнено(Выборка[ПолеАналитики]) Тогда
					ПустыеПоляАналитик.Добавить(ПолеАналитики);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если ПустыеПоляАналитик.Количество() > 0 Тогда
			ПустыеПоляАналитик = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ПустыеПоляАналитик);
			ОбъектыСПустойАналитикой.Вставить(ОбъектПроверки, ПустыеПоляАналитик);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъектыСПустойАналитикой;
	
КонецФункции

Функция ИменаПолейАналитикОборотыПоБюджетам()
	
	ПоляАналитик = Новый Массив;
	ПоляАналитик.Добавить("ЦФО");
	ПоляАналитик.Добавить("СтатьяОборотов");
	
	КоличествоСводныхАналитик = 0;
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ПоляАналитик.Добавить("Контрагент");
		ПоляАналитик.Добавить("ДоговорКонтрагента");
		ПоляАналитик.Добавить("Проект");
		ПоляАналитик.Добавить("НоменклатурнаяГруппа");
		ПоляАналитик.Добавить("БанковскийСчет");
		КоличествоСводныхАналитик = 7;
	Иначе
		КоличествоСводныхАналитик = 12;
	КонецЕсли;
	
	ШаблонИмениСводнойАналитики = "Аналитика_%1";
	Для Сч = 1 По КоличествоСводныхАналитик Цикл
		ИмяСводнойАналитики = СтрШаблон(ШаблонИмениСводнойАналитики, Сч);
		ПоляАналитик.Добавить(ИмяСводнойАналитики);
	КонецЦикла;
	
	Возврат ПоляАналитик;
	
КонецФункции

Функция ТекстЗапросаПроверкиАналитикИзНастройкиСтатьиОборотов(ПоляАналитик)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыПоБюджетам.Регистратор КАК Объект,
	|	&ТекстВыборкиПолейАналитик КАК ТекстВыборкиПолейАналитик
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|		ПО ОборотыПоБюджетам.СтатьяОборотов = СтатьиОборотов.Ссылка
	|			И (ОборотыПоБюджетам.Регистратор В (&ОбъектыПроверки))
	|ИТОГИ ПО
	|	Объект";
	
	ШаблонПоля =
	"	ОборотыПоБюджетам.%1 КАК %1,
	|	СтатьиОборотов.Обязательный_%1 КАК Обязательный_%1";
	ШаблонПредопределенногоПоля =
	"	ОборотыПоБюджетам.%1 КАК %1,
	|	ИСТИНА КАК Обязательный_%1";
	ВыборкиПолейАналитик = Новый Массив;
	Для каждого ПолеАналитики Из ПоляАналитик Цикл
		ЭтоПредопределенное = (ПолеАналитики = "ЦФО") ИЛИ (ПолеАналитики = "СтатьяОборотов");
		ТекстВыборкиПоля = СтрШаблон(?(ЭтоПредопределенное, ШаблонПредопределенногоПоля, ШаблонПоля), ПолеАналитики);
		ВыборкиПолейАналитик.Добавить(ТекстВыборкиПоля);
	КонецЦикла;
	ТекстВыборкиПолейАналитик = СтрСоединить(ВыборкиПолейАналитик, "," + Символы.ПС + Символы.Таб);	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстВыборкиПолейАналитик КАК ТекстВыборкиПолейАналитик",
								ТекстВыборкиПолейАналитик);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПредставлениеИзмеренийОборотовПоБюджетам()
	
	ПредставлениеИзмерений = Новый Соответствие;
	
	НастройкиИзмерений = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();
	Для каждого НастройкаИзмерения Из НастройкиИзмерений Цикл
		ПараметрыИзмерения = НастройкаИзмерения.Значение;
		ПредставлениеИзмерений.Вставить(ПараметрыИзмерения.ИмяИзмерения, ПараметрыИзмерения.Синоним);
	КонецЦикла;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ПредставлениеИзмерений.Вставить("ЦФО",                  НСтр("ru='ЦФО'"));
		ПредставлениеИзмерений.Вставить("СтатьяОборотов",       НСтр("ru='Статья оборотов'"));
		ПредставлениеИзмерений.Вставить("Контрагент",           НСтр("ru='Контрагент'"));
		ПредставлениеИзмерений.Вставить("ДоговорКонтрагента",   НСтр("ru='Договор контрагента'"));
		ПредставлениеИзмерений.Вставить("Проект",               НСтр("ru='Проект'"));
		ПредставлениеИзмерений.Вставить("НоменклатурнаяГруппа", НСтр("ru='Номенклатурная группа'"));
		ПредставлениеИзмерений.Вставить("БанковскийСчет",       НСтр("ru='Банковский счет'"));
	КонецЕсли;

	Возврат ПредставлениеИзмерений;
	
КонецФункции

Процедура ПроверитьСоответствиеСтатейОборотов(ПервичныеДокументы, Настройки)
	
	Если НЕ ПроверятьСоответствиеСтатейОборотов(Настройки.РежимКонтроля) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыБезСоответствияСтатей = ДокументыБезСоответствияСтатей(ПервичныеДокументы);
	Если ДокументыБезСоответствияСтатей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки =
		НСтр("ru='Статьи оборотов в факте бюджета не соответствуют статьям регламентированного учета.
		|	Статьи оборотов в факте бюджета: %1.
		|	Статьи регламентированного учета: %2.
		|	Статьи оборотов в соответствии: %3.'");
	РазделительСтатей = ", ";
	
	Для каждого СтрокаДокумента Из ПервичныеДокументы Цикл
		ДанныеСтатей = ДокументыБезСоответствияСтатей.Получить(СтрокаДокумента.Документ);
		Если ДанныеСтатей = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокумента.ЗаполнениеАналитик = 6;
		
		ТекстОшибки = СтрШаблон(ШаблонОшибки,
						СтрСоединить(ДанныеСтатей.СтатьиОборотовФактические, РазделительСтатей),
						СтрСоединить(ДанныеСтатей.СтатьиРегламентированногоУчета, РазделительСтатей),
						СтрСоединить(ДанныеСтатей.СтатьиОборотовСоответствия, РазделительСтатей));
		ДобавитьОписаниеОшибки(СтрокаДокумента, ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументыБезСоответствияСтатей(ПервичныеДокументы)
	
	ДокументыБезСоответствияСтатей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроверкиСоответствияСтатей();
	
	ОбъектыПроверки = ПервичныеДокументы.ВыгрузитьКолонку("Документ");
	Запрос.УстановитьПараметр("ОбъектыПроверки", ОбъектыПроверки);
	
	ВидыСубконтоСтатей = Новый Массив;
	ВидыСубконтоСтатей.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("ВидыСубконтоСтатей", ВидыСубконтоСтатей);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументов.Следующий() Цикл
		Документ = ВыборкаДокументов.Регистратор;
		СтатьиРегламентированногоУчета = Новый Массив;
		СтатьиОборотовСоответствия     = Новый Массив;
		СтатьиОборотовФактические      = Новый Массив;
		ВыборкаЗаписей = ВыборкаДокументов.Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			СтатьиРегламентированногоУчета.Добавить(ВыборкаЗаписей.СтатьяРегл);
			СтатьиОборотовСоответствия.Добавить(ВыборкаЗаписей.СтатьяХозрасчетный);
			СтатьиОборотовФактические.Добавить(ВыборкаЗаписей.СтатьяОборотыПоБюджетам);
		КонецЦикла;
		СтатьиРегламентированногоУчета =
			бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СтатьиРегламентированногоУчета);
		СтатьиОборотовСоответствия = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СтатьиОборотовСоответствия);
		СтатьиОборотовФактические  = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СтатьиОборотовФактические);
		
		ДанныеСтатей = Новый Структура;
		ДанныеСтатей.Вставить("СтатьиРегламентированногоУчета", СтатьиРегламентированногоУчета);
		ДанныеСтатей.Вставить("СтатьиОборотовСоответствия", СтатьиОборотовСоответствия);
		ДанныеСтатей.Вставить("СтатьиОборотовФактические", СтатьиОборотовФактические);
		
		ДокументыБезСоответствияСтатей.Вставить(Документ, ДанныеСтатей);
	КонецЦикла;
	
	Возврат ДокументыБезСоответствияСтатей;
	
КонецФункции

Функция ТекстЗапросаПроверкиСоответствияСтатей()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	|	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт2 КАК ВидСубконтоДт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт3 КАК ВидСубконтоДт3,
	|	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетКт,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт1 КАК ВидСубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт2 КАК ВидСубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт3 КАК ВидСубконтоКт3
	|ПОМЕСТИТЬ ДвиженияХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|ГДЕ
	|	ХозрасчетныйДвиженияССубконто.Регистратор В(&ОбъектыПроверки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор КАК Регистратор,
	|	ДвиженияХозрасчетный.СчетДт КАК Счет,
	|	ДвиженияХозрасчетный.СубконтоДт1 КАК СтатьяРегл
	|ПОМЕСТИТЬ СтатьиХозрасчетный
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоДт1 В(&ВидыСубконтоСтатей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор,
	|	ДвиженияХозрасчетный.СчетДт,
	|	ДвиженияХозрасчетный.СубконтоДт2
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоДт2 В(&ВидыСубконтоСтатей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор,
	|	ДвиженияХозрасчетный.СчетДт,
	|	ДвиженияХозрасчетный.СубконтоДт3
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоДт3 В(&ВидыСубконтоСтатей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор,
	|	ДвиженияХозрасчетный.СчетКт,
	|	ДвиженияХозрасчетный.СубконтоКт1
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоКт1 В(&ВидыСубконтоСтатей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор,
	|	ДвиженияХозрасчетный.СчетКт,
	|	ДвиженияХозрасчетный.СубконтоКт2
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоКт2 В(&ВидыСубконтоСтатей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияХозрасчетный.Регистратор,
	|	ДвиженияХозрасчетный.СчетКт,
	|	ДвиженияХозрасчетный.СубконтоКт3
	|ИЗ
	|	ДвиженияХозрасчетный КАК ДвиженияХозрасчетный
	|ГДЕ
	|	ДвиженияХозрасчетный.ВидСубконтоКт3 В(&ВидыСубконтоСтатей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияХозрасчетный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиХозрасчетный.Регистратор КАК Регистратор,
	|	СтатьиХозрасчетный.Счет КАК Счет,
	|	СтатьиХозрасчетный.СтатьяРегл КАК СтатьяРегл,
	|	СоответствиеСтатей.СтатьяОборотов КАК СтатьяОборотов
	|ПОМЕСТИТЬ СоответствиеСтатей
	|ИЗ
	|	СтатьиХозрасчетный КАК СтатьиХозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатьиОборотов_СтатьиРегл КАК СоответствиеСтатей
	|		ПО СтатьиХозрасчетный.СтатьяРегл = СоответствиеСтатей.СтатьяРегл
	|			И (СтатьиХозрасчетный.Счет = СоответствиеСтатей.СчетУчетаБУ
	|				ИЛИ СоответствиеСтатей.СчетУчетаБУ = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыПоБюджетам.Регистратор КАК Регистратор,
	|	ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов
	|ПОМЕСТИТЬ СтатьиОборотыПоБюджетам
	|ИЗ
	|	СоответствиеСтатей КАК СоответствиеСтатей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|		ПО СоответствиеСтатей.Регистратор = ОборотыПоБюджетам.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиОборотыПоБюджетам.Регистратор КАК Регистратор,
	|	СтатьиОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов
	|ПОМЕСТИТЬ СтатьиОборотовБезСоответствия
	|ИЗ
	|	СтатьиОборотыПоБюджетам КАК СтатьиОборотыПоБюджетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСтатей КАК СоответствиеСтатей
	|		ПО СтатьиОборотыПоБюджетам.Регистратор = СоответствиеСтатей.Регистратор
	|			И СтатьиОборотыПоБюджетам.СтатьяОборотов = СоответствиеСтатей.СтатьяОборотов
	|ГДЕ
	|	СоответствиеСтатей.СтатьяРегл ЕСТЬ NULL
	|	И СтатьиОборотыПоБюджетам.СтатьяОборотов <> ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеСтатей.Регистратор КАК Регистратор,
	|	СоответствиеСтатей.Счет КАК Счет,
	|	СоответствиеСтатей.СтатьяРегл КАК СтатьяРегл,
	|	СоответствиеСтатей.СтатьяОборотов КАК СтатьяХозрасчетный,
	|	СтатьиОборотовБезСоответствия.СтатьяОборотов КАК СтатьяОборотыПоБюджетам
	|ИЗ
	|	СоответствиеСтатей КАК СоответствиеСтатей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиОборотовБезСоответствия КАК СтатьиОборотовБезСоответствия
	|		ПО СоответствиеСтатей.Регистратор = СтатьиОборотовБезСоответствия.Регистратор
	|ИТОГИ ПО
	|	Регистратор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УдалитьСтрокиБезОшибок(ПервичныеДокументы, Настройки)
	
	Если ПоказыватьВсеДокументы(Настройки.РежимКонтроля) Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = ПервичныеДокументы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаДокумента = ПервичныеДокументы.Получить(Индекс);		
		Если ПустаяСтрока(СтрокаДокумента.ОписаниеОшибки) Тогда
			ПервичныеДокументы.Удалить(СтрокаДокумента);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
